arendst/Tasmota/arduino/version 2.7.1/boards.txt
##############################################################
phoenix_v2.name=Phoenix 2.0
phoenix_v2.build.board=ESP8266_PHOENIX_V2
phoenix_v2.build.variant=phoenix_v2
phoenix_v2.upload.tool=esptool
phoenix_v2.upload.maximum_data_size=81920
phoenix_v2.upload.wait_for_upload_port=true
phoenix_v2.upload.erase_cmd=
phoenix_v2.serial.disableDTR=true
phoenix_v2.serial.disableRTS=true
phoenix_v2.build.mcu=esp8266
phoenix_v2.build.core=esp8266
phoenix_v2.build.spiffs_pagesize=256
phoenix_v2.build.debug_port=
phoenix_v2.build.debug_level=
phoenix_v2.menu.xtal.80=80 MHz
phoenix_v2.menu.xtal.80.build.f_cpu=80000000L
phoenix_v2.menu.xtal.160=160 MHz
phoenix_v2.menu.xtal.160.build.f_cpu=160000000L
phoenix_v2.menu.vt.flash=Flash
phoenix_v2.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
phoenix_v2.menu.vt.heap=Heap
phoenix_v2.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
phoenix_v2.menu.vt.iram=IRAM
phoenix_v2.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
phoenix_v2.menu.exception.legacy=Legacy (new can return nullptr)
phoenix_v2.menu.exception.legacy.build.exception_flags=-fno-exceptions
phoenix_v2.menu.exception.legacy.build.stdcpp_lib=-lstdc++
phoenix_v2.menu.exception.disabled=Disabled (new can abort)
phoenix_v2.menu.exception.disabled.build.exception_flags=-fno-exceptions -DNEW_OOM_ABORT
phoenix_v2.menu.exception.disabled.build.stdcpp_lib=-lstdc++
phoenix_v2.menu.exception.enabled=Enabled
phoenix_v2.menu.exception.enabled.build.exception_flags=-fexceptions
phoenix_v2.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
phoenix_v2.menu.ssl.all=All SSL ciphers (most compatible)
phoenix_v2.menu.ssl.all.build.sslflags=
phoenix_v2.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
phoenix_v2.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
phoenix_v2.build.flash_mode=dio
phoenix_v2.build.flash_flags=-DFLASHMODE_DIO
phoenix_v2.build.flash_freq=40
phoenix_v2.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
phoenix_v2.menu.eesz.4M2M.build.flash_size=4M
phoenix_v2.menu.eesz.4M2M.build.flash_size_bytes=0x400000
phoenix_v2.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
phoenix_v2.menu.eesz.4M2M.build.spiffs_pagesize=256
phoenix_v2.menu.eesz.4M2M.upload.maximum_size=1044464
phoenix_v2.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
phoenix_v2.menu.eesz.4M2M.build.spiffs_start=0x200000
phoenix_v2.menu.eesz.4M2M.build.spiffs_end=0x3FA000
phoenix_v2.menu.eesz.4M2M.build.spiffs_blocksize=8192
phoenix_v2.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
phoenix_v2.menu.eesz.4M3M.build.flash_size=4M
phoenix_v2.menu.eesz.4M3M.build.flash_size_bytes=0x400000
phoenix_v2.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
phoenix_v2.menu.eesz.4M3M.build.spiffs_pagesize=256
phoenix_v2.menu.eesz.4M3M.upload.maximum_size=1044464
phoenix_v2.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
phoenix_v2.menu.eesz.4M3M.build.spiffs_start=0x100000
phoenix_v2.menu.eesz.4M3M.build.spiffs_end=0x3FA000
phoenix_v2.menu.eesz.4M3M.build.spiffs_blocksize=8192
phoenix_v2.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
phoenix_v2.menu.eesz.4M1M.build.flash_size=4M
phoenix_v2.menu.eesz.4M1M.build.flash_size_bytes=0x400000
phoenix_v2.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
phoenix_v2.menu.eesz.4M1M.build.spiffs_pagesize=256
phoenix_v2.menu.eesz.4M1M.upload.maximum_size=1044464
phoenix_v2.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
phoenix_v2.menu.eesz.4M1M.build.spiffs_start=0x300000
phoenix_v2.menu.eesz.4M1M.build.spiffs_end=0x3FA000
phoenix_v2.menu.eesz.4M1M.build.spiffs_blocksize=8192
phoenix_v2.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
phoenix_v2.menu.eesz.4M.build.flash_size=4M
phoenix_v2.menu.eesz.4M.build.flash_size_bytes=0x400000
phoenix_v2.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
phoenix_v2.menu.eesz.4M.build.spiffs_pagesize=256
phoenix_v2.menu.eesz.4M.upload.maximum_size=1044464
phoenix_v2.menu.eesz.4M.build.rfcal_addr=0x3FC000
phoenix_v2.menu.ResetMethod.nodemcu=dtr (aka nodemcu)
phoenix_v2.menu.ResetMethod.nodemcu.upload.resetmethod=--before default_reset --after hard_reset
phoenix_v2.menu.ResetMethod.ck=no dtr (aka ck)
phoenix_v2.menu.ResetMethod.ck.upload.resetmethod=--before no_reset --after soft_reset
phoenix_v2.menu.ip.lm2f=v2 Lower Memory
phoenix_v2.menu.ip.lm2f.build.lwip_include=lwip2/include
phoenix_v2.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
phoenix_v2.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
phoenix_v2.menu.ip.hb2f=v2 Higher Bandwidth
phoenix_v2.menu.ip.hb2f.build.lwip_include=lwip2/include
phoenix_v2.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
phoenix_v2.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
phoenix_v2.menu.ip.lm2n=v2 Lower Memory (no features)
phoenix_v2.menu.ip.lm2n.build.lwip_include=lwip2/include
phoenix_v2.menu.ip.lm2n.build.lwip_lib=-llwip2-536
phoenix_v2.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
phoenix_v2.menu.ip.hb2n=v2 Higher Bandwidth (no features)
phoenix_v2.menu.ip.hb2n.build.lwip_include=lwip2/include
phoenix_v2.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
phoenix_v2.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
phoenix_v2.menu.ip.lm6f=v2 IPv6 Lower Memory
phoenix_v2.menu.ip.lm6f.build.lwip_include=lwip2/include
phoenix_v2.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
phoenix_v2.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
phoenix_v2.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
phoenix_v2.menu.ip.hb6f.build.lwip_include=lwip2/include
phoenix_v2.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
phoenix_v2.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
phoenix_v2.menu.ip.hb1=v1.4 Higher Bandwidth
phoenix_v2.menu.ip.hb1.build.lwip_lib=-llwip_gcc
phoenix_v2.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
phoenix_v2.menu.ip.src=v1.4 Compile from source
phoenix_v2.menu.ip.src.build.lwip_lib=-llwip_src
phoenix_v2.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
phoenix_v2.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
phoenix_v2.menu.dbg.Disabled=Disabled
phoenix_v2.menu.dbg.Disabled.build.debug_port=
phoenix_v2.menu.dbg.Serial=Serial
phoenix_v2.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
phoenix_v2.menu.dbg.Serial1=Serial1
phoenix_v2.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
phoenix_v2.menu.lvl.None____=None
phoenix_v2.menu.lvl.None____.build.debug_level=
phoenix_v2.menu.lvl.SSL=SSL
phoenix_v2.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
phoenix_v2.menu.lvl.TLS_MEM=TLS_MEM
phoenix_v2.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
phoenix_v2.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
phoenix_v2.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
phoenix_v2.menu.lvl.HTTP_SERVER=HTTP_SERVER
phoenix_v2.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
phoenix_v2.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
phoenix_v2.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
phoenix_v2.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
phoenix_v2.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
phoenix_v2.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
phoenix_v2.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
phoenix_v2.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
phoenix_v2.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
phoenix_v2.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
phoenix_v2.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
phoenix_v2.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
phoenix_v2.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
phoenix_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
phoenix_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
phoenix_v2.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
phoenix_v2.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
phoenix_v2.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
phoenix_v2.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
phoenix_v2.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
phoenix_v2.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
phoenix_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
phoenix_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
phoenix_v2.menu.lvl.CORE=CORE
phoenix_v2.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
phoenix_v2.menu.lvl.WIFI=WIFI
phoenix_v2.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
phoenix_v2.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
phoenix_v2.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
phoenix_v2.menu.lvl.UPDATER=UPDATER
phoenix_v2.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
phoenix_v2.menu.lvl.OTA=OTA
phoenix_v2.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
phoenix_v2.menu.lvl.OOM=OOM
phoenix_v2.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
phoenix_v2.menu.lvl.MDNS=MDNS
phoenix_v2.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
phoenix_v2.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
phoenix_v2.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
phoenix_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
phoenix_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
phoenix_v2.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
phoenix_v2.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
phoenix_v2.menu.wipe.none=Only Sketch
phoenix_v2.menu.wipe.none.upload.erase_cmd=
phoenix_v2.menu.wipe.sdk=Sketch + WiFi Settings
phoenix_v2.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
phoenix_v2.menu.wipe.all=All Flash Contents
phoenix_v2.menu.wipe.all.upload.erase_cmd=erase_flash
phoenix_v2.menu.baud.115200=115200
phoenix_v2.menu.baud.115200.upload.speed=115200
phoenix_v2.menu.baud.57600=57600
phoenix_v2.menu.baud.57600.upload.speed=57600
phoenix_v2.menu.baud.230400.linux=230400
phoenix_v2.menu.baud.230400.macosx=230400
phoenix_v2.menu.baud.230400.upload.speed=230400
phoenix_v2.menu.baud.256000.windows=256000
phoenix_v2.menu.baud.256000.upload.speed=256000
phoenix_v2.menu.baud.460800.linux=460800
phoenix_v2.menu.baud.460800.macosx=460800
phoenix_v2.menu.baud.460800.upload.speed=460800
phoenix_v2.menu.baud.512000.windows=512000
phoenix_v2.menu.baud.512000.upload.speed=512000
phoenix_v2.menu.baud.921600=921600
phoenix_v2.menu.baud.921600.upload.speed=921600
phoenix_v2.menu.baud.3000000=3000000
phoenix_v2.menu.baud.3000000.upload.speed=3000000

