arendst/Tasmota/arduino/version 2.7.1/boards.txt
##############################################################
eduinowifi.name=Schirmilabs Eduino WiFi
eduinowifi.build.board=ESP8266_SCHIRMILABS_EDUINO_WIFI
eduinowifi.build.variant=eduinowifi
eduinowifi.upload.tool=esptool
eduinowifi.upload.maximum_data_size=81920
eduinowifi.upload.wait_for_upload_port=true
eduinowifi.upload.erase_cmd=
eduinowifi.serial.disableDTR=true
eduinowifi.serial.disableRTS=true
eduinowifi.build.mcu=esp8266
eduinowifi.build.core=esp8266
eduinowifi.build.spiffs_pagesize=256
eduinowifi.build.debug_port=
eduinowifi.build.debug_level=
eduinowifi.menu.xtal.80=80 MHz
eduinowifi.menu.xtal.80.build.f_cpu=80000000L
eduinowifi.menu.xtal.160=160 MHz
eduinowifi.menu.xtal.160.build.f_cpu=160000000L
eduinowifi.menu.vt.flash=Flash
eduinowifi.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
eduinowifi.menu.vt.heap=Heap
eduinowifi.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
eduinowifi.menu.vt.iram=IRAM
eduinowifi.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
eduinowifi.menu.exception.legacy=Legacy (new can return nullptr)
eduinowifi.menu.exception.legacy.build.exception_flags=-fno-exceptions
eduinowifi.menu.exception.legacy.build.stdcpp_lib=-lstdc++
eduinowifi.menu.exception.disabled=Disabled (new can abort)
eduinowifi.menu.exception.disabled.build.exception_flags=-fno-exceptions -DNEW_OOM_ABORT
eduinowifi.menu.exception.disabled.build.stdcpp_lib=-lstdc++
eduinowifi.menu.exception.enabled=Enabled
eduinowifi.menu.exception.enabled.build.exception_flags=-fexceptions
eduinowifi.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
eduinowifi.menu.ssl.all=All SSL ciphers (most compatible)
eduinowifi.menu.ssl.all.build.sslflags=
eduinowifi.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
eduinowifi.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
eduinowifi.upload.resetmethod=--before default_reset --after hard_reset
eduinowifi.build.flash_mode=dio
eduinowifi.build.flash_flags=-DFLASHMODE_DIO
eduinowifi.build.flash_freq=40
eduinowifi.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
eduinowifi.menu.eesz.4M2M.build.flash_size=4M
eduinowifi.menu.eesz.4M2M.build.flash_size_bytes=0x400000
eduinowifi.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
eduinowifi.menu.eesz.4M2M.build.spiffs_pagesize=256
eduinowifi.menu.eesz.4M2M.upload.maximum_size=1044464
eduinowifi.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
eduinowifi.menu.eesz.4M2M.build.spiffs_start=0x200000
eduinowifi.menu.eesz.4M2M.build.spiffs_end=0x3FA000
eduinowifi.menu.eesz.4M2M.build.spiffs_blocksize=8192
eduinowifi.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
eduinowifi.menu.eesz.4M3M.build.flash_size=4M
eduinowifi.menu.eesz.4M3M.build.flash_size_bytes=0x400000
eduinowifi.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
eduinowifi.menu.eesz.4M3M.build.spiffs_pagesize=256
eduinowifi.menu.eesz.4M3M.upload.maximum_size=1044464
eduinowifi.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
eduinowifi.menu.eesz.4M3M.build.spiffs_start=0x100000
eduinowifi.menu.eesz.4M3M.build.spiffs_end=0x3FA000
eduinowifi.menu.eesz.4M3M.build.spiffs_blocksize=8192
eduinowifi.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
eduinowifi.menu.eesz.4M1M.build.flash_size=4M
eduinowifi.menu.eesz.4M1M.build.flash_size_bytes=0x400000
eduinowifi.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
eduinowifi.menu.eesz.4M1M.build.spiffs_pagesize=256
eduinowifi.menu.eesz.4M1M.upload.maximum_size=1044464
eduinowifi.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
eduinowifi.menu.eesz.4M1M.build.spiffs_start=0x300000
eduinowifi.menu.eesz.4M1M.build.spiffs_end=0x3FA000
eduinowifi.menu.eesz.4M1M.build.spiffs_blocksize=8192
eduinowifi.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
eduinowifi.menu.eesz.4M.build.flash_size=4M
eduinowifi.menu.eesz.4M.build.flash_size_bytes=0x400000
eduinowifi.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
eduinowifi.menu.eesz.4M.build.spiffs_pagesize=256
eduinowifi.menu.eesz.4M.upload.maximum_size=1044464
eduinowifi.menu.eesz.4M.build.rfcal_addr=0x3FC000
eduinowifi.menu.ip.lm2f=v2 Lower Memory
eduinowifi.menu.ip.lm2f.build.lwip_include=lwip2/include
eduinowifi.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
eduinowifi.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
eduinowifi.menu.ip.hb2f=v2 Higher Bandwidth
eduinowifi.menu.ip.hb2f.build.lwip_include=lwip2/include
eduinowifi.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
eduinowifi.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
eduinowifi.menu.ip.lm2n=v2 Lower Memory (no features)
eduinowifi.menu.ip.lm2n.build.lwip_include=lwip2/include
eduinowifi.menu.ip.lm2n.build.lwip_lib=-llwip2-536
eduinowifi.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
eduinowifi.menu.ip.hb2n=v2 Higher Bandwidth (no features)
eduinowifi.menu.ip.hb2n.build.lwip_include=lwip2/include
eduinowifi.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
eduinowifi.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
eduinowifi.menu.ip.lm6f=v2 IPv6 Lower Memory
eduinowifi.menu.ip.lm6f.build.lwip_include=lwip2/include
eduinowifi.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
eduinowifi.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
eduinowifi.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
eduinowifi.menu.ip.hb6f.build.lwip_include=lwip2/include
eduinowifi.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
eduinowifi.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
eduinowifi.menu.ip.hb1=v1.4 Higher Bandwidth
eduinowifi.menu.ip.hb1.build.lwip_lib=-llwip_gcc
eduinowifi.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
eduinowifi.menu.ip.src=v1.4 Compile from source
eduinowifi.menu.ip.src.build.lwip_lib=-llwip_src
eduinowifi.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
eduinowifi.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
eduinowifi.menu.dbg.Disabled=Disabled
eduinowifi.menu.dbg.Disabled.build.debug_port=
eduinowifi.menu.dbg.Serial=Serial
eduinowifi.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
eduinowifi.menu.dbg.Serial1=Serial1
eduinowifi.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
eduinowifi.menu.lvl.None____=None
eduinowifi.menu.lvl.None____.build.debug_level=
eduinowifi.menu.lvl.SSL=SSL
eduinowifi.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
eduinowifi.menu.lvl.TLS_MEM=TLS_MEM
eduinowifi.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
eduinowifi.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
eduinowifi.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
eduinowifi.menu.lvl.HTTP_SERVER=HTTP_SERVER
eduinowifi.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
eduinowifi.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
eduinowifi.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
eduinowifi.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
eduinowifi.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
eduinowifi.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
eduinowifi.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
eduinowifi.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
eduinowifi.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
eduinowifi.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
eduinowifi.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
eduinowifi.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
eduinowifi.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
eduinowifi.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
eduinowifi.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
eduinowifi.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
eduinowifi.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
eduinowifi.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
eduinowifi.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
eduinowifi.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
eduinowifi.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
eduinowifi.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
eduinowifi.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
eduinowifi.menu.lvl.CORE=CORE
eduinowifi.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
eduinowifi.menu.lvl.WIFI=WIFI
eduinowifi.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
eduinowifi.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
eduinowifi.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
eduinowifi.menu.lvl.UPDATER=UPDATER
eduinowifi.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
eduinowifi.menu.lvl.OTA=OTA
eduinowifi.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
eduinowifi.menu.lvl.OOM=OOM
eduinowifi.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
eduinowifi.menu.lvl.MDNS=MDNS
eduinowifi.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
eduinowifi.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
eduinowifi.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
eduinowifi.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
eduinowifi.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
eduinowifi.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
eduinowifi.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
eduinowifi.menu.wipe.none=Only Sketch
eduinowifi.menu.wipe.none.upload.erase_cmd=
eduinowifi.menu.wipe.sdk=Sketch + WiFi Settings
eduinowifi.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
eduinowifi.menu.wipe.all=All Flash Contents
eduinowifi.menu.wipe.all.upload.erase_cmd=erase_flash
eduinowifi.menu.baud.512000.windows=512000
eduinowifi.menu.baud.512000.upload.speed=512000
eduinowifi.menu.baud.57600=57600
eduinowifi.menu.baud.57600.upload.speed=57600
eduinowifi.menu.baud.115200=115200
eduinowifi.menu.baud.115200.upload.speed=115200
eduinowifi.menu.baud.230400.linux=230400
eduinowifi.menu.baud.230400.macosx=230400
eduinowifi.menu.baud.230400.upload.speed=230400
eduinowifi.menu.baud.256000.windows=256000
eduinowifi.menu.baud.256000.upload.speed=256000
eduinowifi.menu.baud.460800.linux=460800
eduinowifi.menu.baud.460800.macosx=460800
eduinowifi.menu.baud.460800.upload.speed=460800
eduinowifi.menu.baud.921600=921600
eduinowifi.menu.baud.921600.upload.speed=921600
eduinowifi.menu.baud.3000000=3000000
eduinowifi.menu.baud.3000000.upload.speed=3000000

